In [ ]:
import pymysql as ps

connection=ps.connect(
     host="localhost",
     user="root",
     password="12da12"
)

my_cursor=connection.cursor()

1

In [ ]:
# creates the databases
my_cursor.execute("create database management")

1

In [ ]:
# shows the databases
my_database_show=my_cursor.execute("show databases")
for i in my_cursor:
     print(i)

('database_demo',)
('information_schema',)
('management',)
('mydatabase',)
('mysql',)
('new_database_demo',)
('performance_schema',)
('sys',)

In [ ]:
# ues the database
my_cursor.execute("use management")

0

In [ ]:
# creates the table in data base (management)
my_cursor.execute("create table customer(name varchar(225), address varchar(225), age int(10))")

0

In [ ]:
# shows the table
my_cursor.execute("show tables")

1

In [ ]:
for i in my_cursor:
     print(i)

('customer',)

In [ ]:
# adding primary key with altger command in customer table
my_cursor.execute("alter table customer add column id int auto_increment primary key")

0

In [ ]:
# inserting data into the customer table

data_insert = "insert into customer (name, address, age) VALUES (%s, %s, %s)"
data_values = [
  ('Peter', 'Lowstreet 4', 23),
  ('Amy', 'Apple st 652', 24),
  ('Hannah', 'Mountain 21', 55),
  ('Michael', 'Valley 345', 64),
  ('Sandy', 'Ocean blvd 2', 33),
  ('Betty', 'Green Grass 1', 35),
  ('Richard', 'Sky st 331', 20),
  ('Susan', 'One way 98', 21),
  ('Vicky', 'Yellow Garden 2', 25),
  ('Ben', 'Park Lane 38', 19),
  ('William', 'Central st 954', 22),
  ('Chuck', 'Main Road 989', 30),
  ('Viola', 'Sideway 1633', 34)
]

In [ ]:
# executemany, executes multiple queries 

my_cursor.executemany(data_insert,data_values)

13

In [ ]:
# commiting to connection 
connection.commit()

In [ ]:
# select query to select all from the table
my_cursor.execute("select * from customer")

26

In [ ]:
# fetchall query fetches all the data which is present in the table 
final_result=my_cursor.fetchall()
for i in final_result:
     print(i)

('Peter', 'Lowstreet 4', 23, 1)
('Amy', 'Apple st 652', 24, 2)
('Hannah', 'Mountain 21', 55, 3)
('Michael', 'Valley 345', 64, 4)
('Sandy', 'Ocean blvd 2', 33, 5)
('Betty', 'Green Grass 1', 35, 6)
('Richard', 'Sky st 331', 20, 7)
('Susan', 'One way 98', 21, 8)
('Vicky', 'Yellow Garden 2', 25, 9)
('Ben', 'Park Lane 38', 19, 10)
('William', 'Central st 954', 22, 11)
('Chuck', 'Main Road 989', 30, 12)
('Viola', 'Sideway 1633', 34, 13)
('Peter', 'Lowstreet 4', 23, 14)
('Amy', 'Apple st 652', 24, 15)
('Hannah', 'Mountain 21', 55, 16)
('Michael', 'Valley 345', 64, 17)
('Sandy', 'Ocean blvd 2', 33, 18)
('Betty', 'Green Grass 1', 35, 19)
('Richard', 'Sky st 331', 20, 20)
('Susan', 'One way 98', 21, 21)
('Vicky', 'Yellow Garden 2', 25, 22)
('Ben', 'Park Lane 38', 19, 23)
('William', 'Central st 954', 22, 24)
('Chuck', 'Main Road 989', 30, 25)
('Viola', 'Sideway 1633', 34, 26)

In [ ]:
# we can also fetchall desire attributes from the table
my_cursor.execute("select name, address from customer")
for i in my_cursor:
     print(i)

('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')